{"Database": [{"country": "Afghanistan", "fact": " it is bordered by Pakistan to the east and south; Iran to the west; Turkmenistan, Uzbekistan, and Tajikistan to the north; and China to the northeast. Occupying 652,000 square kilometers (252,000 sq mi), it is a mountainous country with plains in the north and southwest.", "latitude": 33.7680065, "longitude": 66.2385139}, {"country": "Albania", "fact": " It shares land borders with Montenegro to the northwest, Kosovo to the northeast, North Macedonia to the east, Greece to the south and maritime borders with Greece, Montenegro and Italy to the west.\nGeographically, the country displays varied climatic, geological, hydrological and morphological conditions, defined in an area of 28,748 km2 (11,100 sq mi).", "latitude": 41.000028, "longitude": 19.9999619}, {"country": "Algeria", "fact": " Its southern coast is on the Gulf of Guinea in the Atlantic Ocean. Nigeria is a federal republic comprising 36 states and the Federal Capital Territory, where the capital, Abuja, is located.", "latitude": 28.0000272, "longitude": 2.9999825}, {"country": "Andorra", "fact": " Believed to have been created by Charlemagne, it was ruled by the count of Urgell until 988, when it was transferred to the Roman Catholic Diocese of Urgell. The present principality was formed by a charter in 1278.", "latitude": 42.5407167, "longitude": 1.5732033}, {"country": "Angola", "fact": " It is the seventh-largest country in Africa, bordered by Namibia to the south, the Democratic Republic of the Congo to the north, Zambia to the east, and the Atlantic Ocean to the west. it has an exclave province, the province of Cabinda that borders the Republic of the Congo and the Democratic Republic of the Congo.", "latitude": -11.8775768, "longitude": 17.5691241}, {"country": "Argentina", "fact": " Sharing the bulk of the Southern Cone with Chile to the west, the country is also bordered by Bolivia and Paraguay to the north, Brazil to the northeast, Uruguay and the South Atlantic Ocean to the east, and the Drake Passage to the south. With a mainland area of 2,780,400 km2 (1,073,500 sq mi), it is the eighth-largest country in the world, the fourth largest in the Americas, the second largest in South America after Brazil, and the largest Spanish-speaking nation by area.", "latitude": -34.9964963, "longitude": -64.9672817}, {"country": "Armenia", "fact": " Located in Western Asia, on the itn Highlands, it is bordered by Turkey to the west, Georgia to the north, the de facto independent Republic of Artsakh and Azerbaijan to the east, and Iran and Azerbaijan's exclave of Nakhchivan to the south.it is a unitary, multi-party, democratic nation-state with an ancient cultural heritage. Urartu was established in 860 BC and by the 6th century BC it was replaced by the Satrapy of it.", "latitude": 40.7696272, "longitude": 44.6736646}, {"country": "Australia", "fact": " It is the largest country in Oceania and the world's sixth-largest country by total area. The population of 26 million is highly urbanised and heavily concentrated on the eastern seaboard.", "latitude": -24.7761086, "longitude": 134.755}, {"country": "Austria", "fact": " It is the largest country in Oceania and the world's sixth-largest country by total area. The population of 26 million is highly urbanised and heavily concentrated on the eastern seaboard.", "latitude": 47.2000338, "longitude": 13.199959}, {"country": "Azerbaijan", "fact": " It is bounded by the Caspian Sea to the east, Russia to the north, Georgia to the northwest, Armenia to the west and Iran to the south. The exclave of Nakhchivan is bounded by Armenia to the north and east, Iran to the south and west, and has an 11 km (6.8 mi) long border with Turkey in the northwest.", "latitude": 40.3936294, "longitude": 47.7872508}, {"country": "Bahamas", "fact": " It takes up 97% of the Lucayan Archipelago's land area and is home to 88% of the archipelago's population. The archipelagic state consists of fewer than 700 islands, cays, and islets in the Atlantic Ocean, and is located north of Cuba and Hispaniola Island (Haiti and the Dominican Republic), northwest of the Turks and Caicos Islands, southeast of the US state of Florida, and east of the Florida Keys.", "latitude": 24.7736546, "longitude": -78.0000547}, {"country": "Bahrain", "fact": " The island nation comprises a small archipelago made up of 33 natural islands and an additional 51 artificial islands, centered around it Island which makes up around 83 percent of the country's landmass. The country is situated between the Qatar peninsula and the north eastern coast of Saudi Arabia, to which it is connected by the 25-kilometre (16 mi) King Fahd Causeway.", "latitude": 26.1551249, "longitude": 50.5344606}, {"country": "Bangladesh", "fact": " It is the eighth-most populous country in the world, with a population exceeding 162 million people. In terms of land mass, it ranks 92nd, spanning 148,460 square kilometres (57,320 sq mi), making it one of the most densely-populated countries in the world.", "latitude": 24.4768783, "longitude": 90.2932426}, {"country": "Barbados", "fact": " It is 34 kilometres (21 miles) in length and up to 23 km (14 mi) in width, covering an area of 432 km2 (167 sq mi). It is situated in the western area of the North Atlantic and 100 km (62 mi) east of the Windward Islands and the Caribbean Sea; therein, it is east of the Windwards, part of the Lesser Antilles, roughly at 13°N of the equator.", "latitude": 13.1500331, "longitude": -59.5250305}, {"country": "Belarus", "fact": " It is bordered by Russia to the northeast, Ukraine to the south, Poland to the west, and Lithuania and Latvia to the northwest. Its capital and most populous city is Minsk.", "latitude": 53.4250605, "longitude": 27.6971358}, {"country": "Belgium", "fact": " It is bordered by the Netherlands to the north, Germany to the east, Luxembourg to the southeast, France to the southwest, and the North Sea to the northwest. It covers an area of 30,689 km2 (11,849 sq mi) and has a population of more than 11.5 million, making it the 22nd most densely populated country in the world and the 6th most densely populated country in Europe, with a density of 376 per square kilometre (970/sq mi).", "latitude": 50.6402809, "longitude": 4.6667145}, {"country": "Belize", "fact": " it is bordered on the northwest by Mexico, on the east by the Caribbean Sea, and on the south and west by Guatemala. It has an area of 22,970 square kilometres (8,867 sq mi) and a population of 408,487 (2019).", "latitude": 16.8259793, "longitude": -88.7600927}, {"country": "Benin", "fact": " It is bordered by Togo to the west, Nigeria to the east, Burkina Faso to the north-west, and Niger to the north-east. The majority of its population lives on the small southern coastline of the Bight of it, part of the Gulf of Guinea in the northernmost tropical portion of the Atlantic Ocean.", "latitude": 9.5293472, "longitude": 2.2584408}, {"country": "Bhutan", "fact": " Located in the Eastern Himalayas, it is bordered by Tibet in the north, the Chumbi Valley of Tibet and the Indian states of Sikkim and West Bengal in the west, and the Indian states of Assam, West Bengal and Arunachal Pradesh in the south and east. it is geopolitically in South Asia and is the region's second-least-populous nation after the Maldives.", "latitude": 27.549511, "longitude": 90.5119273}, {"country": "Bolivia", "fact": " The constitutional capital is Sucre, while the seat of government and executive capital is La Paz. The largest city and principal industrial center is Santa Cruz de la Sierra, located on the Llanos Orientales (tropical lowlands), a mostly flat region in the east of the country.", "latitude": -17.0568696, "longitude": -64.9912286}, {"country": "Bosnia Herzegovina", "fact": " Sarajevo is the capital and largest city.\nBosnia and Herzegovina is not entirely a landlocked country as it may appear on a map – to the south it has a narrow coast on the Adriatic Sea, which is about 20 kilometres (12 miles) long and surrounds the town of Neum.", "latitude": 44.3053476, "longitude": 17.5961467}, {"country": "Botswana", "fact": " Formerly the British protectorate of Bechuanaland, it adopted its name after becoming independent within the Commonwealth on 30 September 1966. Since then, it has been a representative republic, with a consistent record of uninterrupted democratic elections and the lowest perceived corruption ranking in Africa since at least 1998.", "latitude": -23.1681782, "longitude": 24.5928742}, {"country": "Brazil", "fact": " At 8.5 million square kilometers (3.2 million square miles) and with over 211 million people, it is the world's fifth-largest country by area and the sixth most populous. Its capital is Brasília, and its most populous city is São Paulo.", "latitude": -10.3333333, "longitude": -53.2}, {"country": "Brunei", "fact": " Apart from its coastline with the South China Sea, the country is completely surrounded by the insular Malaysian state of Sarawak. It is separated into two parts by the Sarawak district of Limbang.", "latitude": 4.4137155, "longitude": 114.5653908}, {"country": "Bulgaria", "fact": " It is bordered by Romania to the north, Serbia and North Macedonia to the west, Greece and Turkey to the south, and the Black Sea to the east. The capital and largest city is Sofia; other major cities are Plovdiv, Varna and Burgas.", "latitude": 42.6073975, "longitude": 25.4856617}, {"country": "Burkina", "fact": " It covers an area of around 274,200 square kilometres (105,900 sq mi) and is surrounded by six countries: Mali to the north and west; Niger to the east; Benin to the southeast; Togo to the southeast; Ghana to the south; and Ivory Coast to the southwest. The July 2019 population estimate by the United Nations was 20,321,378.", "latitude": 12.0753083, "longitude": -1.6880314}, {"country": "Burundi", "fact": " It is bordered by Rwanda to the north, Tanzania to the east and southeast, and the Democratic Republic of the Congo to the west; Lake Tanganyika lies along its southwestern border. The capital cities are Gitega and Bujumbura.The Twa, Hutu and Tutsi peoples have lived in it for at least 500 years.", "latitude": -3.3634357, "longitude": 29.8870575}, {"country": "Cambodia", "fact": " It is 181,035 square kilometres (69,898 square miles) in area, bordered by Thailand to the northwest, Laos to the northeast, Vietnam to the east and the Gulf of Thailand to the southwest.\nThe sovereign state of it has a population of over 15 million.", "latitude": 13.5066394, "longitude": 104.869423}, {"country": "Canada", "fact": " Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering 9.98 million square kilometres (3.85 million square miles), making it the world's second-largest country by total area. Its southern and western border with the United States, stretching 8,891 kilometres (5,525 mi), is the world's longest bi-national land border.", "latitude": 61.0666922, "longitude": -107.9917071}, {"country": "Cape Verde", "fact": " The ten  volcanic islands in its archipelago have a combined land area of about 4,033 square kilometres (1,557 sq mi). The capital Praia, on the southern coast of  Santiago island, lies approximately 650 kilometres (400 mi) west of Dakar, Senegal on the it Peninsula, the westernmost point of continental Africa.", "latitude": 16.0000552, "longitude": -24.0083947}, {"country": "Chad", "fact": " It is bordered by Libya to the north, Sudan to the east, the Central African Republic to the south, Cameroon to the south-west, Nigeria to the southwest (at Lake it), and Niger to the west.\nit has several regions: a desert zone in the north, an arid Sahelian belt in the centre and a more fertile Sudanian Savanna zone in the south.", "latitude": 15.6134137, "longitude": 19.0156172}, {"country": "Chile", "fact": " It is the world's most populous country, with a population of around 1.4 billion in 2019. Covering approximately 9.6 million square kilometres (3.7 million mi2), it is the world's third- or fourth-largest country by area.", "latitude": -31.7613365, "longitude": -71.3187697}, {"country": "China", "fact": " It is the world's most populous country, with a population of around 1.4 billion in 2019. Covering approximately 9.6 million square kilometres (3.7 million mi2), it is the world's third- or fourth-largest country by area.", "latitude": 35.000074, "longitude": 104.999927}, {"country": "Comoros", "fact": " It shares maritime borders with Madagascar and the French region of Mayotte to the southeast, Tanzania to the northwest, Mozambique to the west, and the Seychelles to the northeast. The capital and largest city in it is Moroni.", "latitude": -12.2045176, "longitude": 44.2832964}, {"country": "Costa Rica", "fact": " It has a population of around 5 million in a land area of 51,060 square kilometers (19,714 square miles). An estimated 333,980 people live in the capital and largest city, San José, with around 2 million people in the surrounding metropolitan area.The sovereign state is a unitary presidential constitutional republic.", "latitude": 10.2735633, "longitude": -84.0739102}, {"country": "Croatia", "fact": " It borders Slovenia to the northwest, Hungary to the northeast, Serbia to the east, Bosnia and Herzegovina, and Montenegro to the southeast, sharing a maritime border with Italy. Its capital, Zagreb, forms one of the country's primary subdivisions, along with twenty counties.", "latitude": 45.5643442, "longitude": 17.0118954}, {"country": "Cuba", "fact": " it is located in the northern Caribbean where the Caribbean Sea, Gulf of Mexico and Atlantic Ocean meet. It is east of the Yucatán Peninsula (Mexico), south of both the U.S. state of Florida and the Bahamas, west of Haiti and north of both Jamaica and the Cayman Islands.", "latitude": 23.0131338, "longitude": -80.8328748}, {"country": "Cyprus", "fact": " The third largest and third most populous island in the Mediterranean, it is located south of Turkey; west of Syria and Lebanon; north of Egypt, Israel, and the Palestinian region of the Gaza Strip; and southeast of Greece.\nThe earliest known human activity on the island dates to around the 10th millennium BC. Archaeological remains from this period include the well-preserved Neolithic village of Khirokitia, and it is home to some of the oldest water wells in the world.", "latitude": 34.9823018, "longitude": 33.1451285}, {"country": "Czech Republic", "fact": " The it has hilly landscape that covers an area of 78,866 square kilometers (30,450 sq mi) with a mostly temperate continental climate and oceanic climate. It is a unitary parliamentary republic, with 10.7 million inhabitants.", "latitude": 49.8167003, "longitude": 15.4749544}, {"country": "Denmark", "fact": " it proper, which is the southernmost of the Scandinavian countries, consists of a peninsula, Jutland, and an archipelago of 443 named islands, with the largest being Zealand, Funen and the North Jutlandic Island. The islands are characterised by flat, arable land and sandy coasts, low elevation and a temperate climate.", "latitude": 55.670249, "longitude": 10.3333283}, {"country": "Djibouti", "fact": " It is bordered by Somalia in the south, Ethiopia in the south and west, Eritrea in the north, and the Red Sea and the Gulf of Aden in the east. Across the Gulf of Aden lies Yemen.", "latitude": 11.8145966, "longitude": 42.8453061}, {"country": "Dominica", "fact": " Originally from the late Roman-Italic name \"Dominicus\", its translation means \"Lordly\", \"Belonging to God\" or \"of the Master\". Variations include: Dominicus (Latin rendition), Dominik, Dominick, Domenic, Domenico (Italian), Domanic, Domonic, Domingo (Spanish), Dominykas (Lithuanian), Domingos (Portuguese), Dominggus; and the feminine forms it, Dominika, Domenica, Dominga, Domingas; as well as the unisex French origin Dominique.The most prominent Roman Catholic with the name, Saint Dominic, founded the Order of Preachers, also known as itn friars.", "latitude": 19.0974031, "longitude": -70.3028026}, {"country": "Dominican Republic", "fact": " It occupies the eastern five-eighths of the island, which it shares with Haiti, making Hispaniola one of only two Caribbean islands, along with Saint Martin, that are shared by two sovereign states. The it is the second-largest nation in the Antilles by area (after Cuba) at 48,671 square kilometers (18,792 sq mi), and third by population with approximately 10.5 million people (2020 est.), of whom approximately 3.3 million live in the metropolitan area of Santo Domingo, the capital city.", "latitude": 19.0974031, "longitude": -70.3028026}, {"country": "Ecuador", "fact": " it also includes the Galápagos Islands in the Pacific, about 1,000 kilometres (621 mi) west of the mainland. The capital is Quito.The territories of modern-day it were once home to a variety of Amerindian groups that were gradually incorporated into the Inca Empire during the 15th century.", "latitude": -1.3397668, "longitude": -79.3666965}, {"country": "Egypt", "fact": " it is a Mediterranean country bordered by the Gaza Strip (Palestine) and Israel to the northeast, the Gulf of Aqaba and the Red Sea to the east, Sudan to the south, and Libya to the west. Across the Gulf of Aqaba lies Jordan, across the Red Sea lies Saudi Arabia, and across the Mediterranean lie Greece, Turkey and Cyprus, although none share a land border with it.", "latitude": 26.2540493, "longitude": 29.2675469}, {"country": "El Salvador", "fact": " It is bordered on the northeast by Honduras, on the northwest by Guatemala, and on the south by the Pacific Ocean. it's capital and largest city is San Salvador.", "latitude": 13.8000382, "longitude": -88.9140683}, {"country": "Equatorial Guinea", "fact": " Formerly the colony of Spanish Guinea, its post-independence name evokes its location near both the Equator and the Gulf of Guinea. it is the only sovereign African state in which Spanish is an official language.", "latitude": 1.613172, "longitude": 10.5170357}, {"country": "Eritrea", "fact": " It is bordered by Sudan in the west, Ethiopia in the south, and Djibouti in the southeast. The northeastern and eastern parts of it have an extensive coastline along the Red Sea.", "latitude": 15.9500319, "longitude": 37.9999668}, {"country": "Estonia", "fact": " It is bordered to the north by the Gulf of Finland across from Finland, to the west by the Baltic Sea across from Sweden, to the south by Latvia (343 km), and to the east by Lake Peipus and Russia (338.6 km). The territory of it consists of the mainland and of 2,222 islands in the Baltic Sea, covering a total area of 45,227 km2 (17,462 sq mi), water 2,839 km2 (1,096 sq mi), land area 42,388 km2 (16,366 sq mi), and is influenced by a humid continental climate.", "latitude": 58.7523778, "longitude": 25.3319078}, {"country": "Ethiopia", "fact": " Oromo: Itoophiyaa, Somali: Itoobiya, Tigrinya: ኢትዮጵያ), officially the Federal Democratic Republic of it, is a landlocked country in the Horn of Africa. It shares borders with Eritrea to the north, Djibouti to the northeast, Somalia to the east, Kenya to the south, South Sudan to the west and Sudan to the northwest.", "latitude": 10.2116702, "longitude": 38.6521203}, {"country": "Fiji", "fact": " Its closest neighbours are Vanuatu to the west, New Caledonia to the southwest, New Zealand's Kermadec Islands to the southeast, Tonga to the east, the Samoas and France's Wallis and Futuna to the northeast, and Tuvalu to the north. it consists of an archipelago of more than 330 islands—of which about 110 are permanently inhabited—and more than 500 islets, amounting to a total land area of about 18,300 square kilometres (7,100 sq mi).", "latitude": -18.1239696, "longitude": 179.0122737}, {"country": "Finland", "fact": " Bounded by the Baltic Sea to its southwest, the Gulf of Bothnia on the west, and the Gulf of it on the south, it shares land borders with Sweden to the west, Russia to the east, and Norway to the north. Helsinki, the capital of it, and Tampere are largest cities and urban areas in the whole country.", "latitude": 63.2467777, "longitude": 25.9209164}, {"country": "France", "fact": " The metropolitan area of it extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It borders Belgium, Luxembourg and Germany to the northeast, Switzerland, Monaco, and Italy to the east, and Andorra and Spain to the south.", "latitude": 46.603354, "longitude": 1.8883335}, {"country": "Gabon", "fact": " Located on the equator, it is bordered by Equatorial Guinea to the northwest, Cameroon to the north, the Republic of the Congo on the east and south, and the Gulf of Guinea to the west. It has an area of nearly 270,000 square kilometres (100,000 sq mi) and its population is estimated at 2.1 million people.", "latitude": -0.8999695, "longitude": 11.6899699}, {"country": "Gambia", "fact": " Its neighbours are the Democratic Republic of the Congo to the north, Tanzania to the north-east, Malawi to the east, Mozambique to the southeast, Zimbabwe and Botswana to the south, Namibia to the southwest, and Angola to the west. The capital city is Lusaka, located in the south-central part of Zambia.", "latitude": 13.470062, "longitude": -15.4900464}, {"country": "Germany", "fact": " Covering an area of 357,022 square kilometres (137,847 sq mi), it lies between the Baltic and North seas to the north, and the Alps to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, and France, Luxembourg, Belgium, and the Netherlands to the west.", "latitude": 51.0834196, "longitude": 10.4234469}, {"country": "Ghana", "fact": " Spanning a land mass of 238,535 km2 (92,099 sq mi), it is bordered by the Ivory Coast in the west, Burkina Faso in the north, Togo in the east, and the Gulf of Guinea and Atlantic Ocean in the south. it means \"Warrior King\" in the Soninke language.The first permanent state in the territory of present-day it dates back to the 11th century.", "latitude": 8.0300284, "longitude": -1.0800271}, {"country": "Greece", "fact": " Its population is approximately 10.7 million as of 2018; Athens, the nation's capital, is its largest city, followed by Thessaloniki.\nSituated on the southern tip of the Balkan Peninsula, it is located at the crossroads of Europe, Asia, and Africa.", "latitude": 38.9953683, "longitude": 21.9877132}, {"country": "Grenada", "fact": " it consists of the island of it itself plus six smaller islands which lie to the north of the main island. It is located northwest of Trinidad and Tobago, northeast of Venezuela and southwest of Saint Vincent and the Grenadines.", "latitude": 12.1360374, "longitude": -61.6904045}, {"country": "Guatemala", "fact": " With an estimated population of around 17.2 million, it is the most populous country in Central America. it is a representative democracy; its capital and largest city is Nueva it de la Asunción, also known as it City.", "latitude": 15.6356088, "longitude": -89.8988087}, {"country": "Guinea", "fact": " Formerly known as French it (French: Guinée française), the modern country is sometimes referred to as it-Conakry to distinguish it from other countries with \"it\" in the name and the eponymous region, such as it-Bissau and Equatorial it. it has a population of 12.4 million and an area of 245,857 square kilometres (94,926 sq mi).The sovereign state of it is a republic with a president who is directly elected by the people; this position is both head of state and head of government.", "latitude": 10.7226226, "longitude": -10.7083587}, {"country": "Guinea-Bissau", "fact": " It borders Senegal to the north and Guinea to the south-east.\nit was once part of the kingdom of Kaabu, as well as part of the Mali Empire.", "latitude": 12.100035, "longitude": -14.9000214}, {"country": "Guyana", "fact": " It is considered part of the Caribbean region because of its strong cultural, historical, and political ties with other Anglo-Caribbean countries and the Caribbean Community (CARICOM). it is bordered by the Atlantic Ocean to the north, Brazil to the south and southwest, Venezuela to the west, and Suriname to the east.", "latitude": 4.8417097, "longitude": -58.6416891}, {"country": "Haiti", "fact": " It occupies the western three-eighths of the island which it shares with the Dominican Republic. To its south-west lies the small island of Navassa Island, which is claimed by it but is disputed as a United States territory under federal administration.", "latitude": 19.1399952, "longitude": -72.3570972}, {"country": "Honduras", "fact": " The republic of it is bordered to the west by Guatemala, to the southwest by El Salvador, to the southeast by Nicaragua, to the south by the Pacific Ocean at the Gulf of Fonseca, and to the north by the Gulf of it, a large inlet of the Caribbean Sea.\nit was home to several important Mesoamerican cultures, most notably the Maya, before the Spanish Colonization in the sixteenth century.", "latitude": 15.2572432, "longitude": -86.0755145}, {"country": "Hungary", "fact": " Spanning 93,030 square kilometres (35,920 sq mi) in the Carpathian Basin, it borders Slovakia to the north, Ukraine to the northeast, Romania to the east and southeast, Serbia to the south, Croatia and Slovenia to the southwest, and Austria to the west. With about 10 million inhabitants, it is a medium-sized member state of the European Union.", "latitude": 47.1817585, "longitude": 19.5060937}, {"country": "Iceland", "fact": " It is separated from Great Britain to its east by the North Channel, the Irish Sea, and St George's Channel. Ireland is the second-largest island of the British Isles, the third-largest in Europe, and the twentieth-largest on Earth.Geopolitically, Ireland is divided between the Republic of Ireland (officially named Ireland), which covers five-sixths of the island, and Northern Ireland, which is part of the United Kingdom.", "latitude": 64.9841821, "longitude": -18.1059013}, {"country": "India", "fact": " It is the second-most populous country, the seventh-largest country by area, and the most populous democracy in the world. Bounded by the itn Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east.", "latitude": 22.3511148, "longitude": 78.6677428}, {"country": "Indonesia", "fact": " It consists of more than seventeen thousand islands, including Sumatra, Java, Borneo (Kalimantan), Sulawesi, and New Guinea (Papua). it is the world's largest island country and the 14th largest country by land area, at 1,904,569 square kilometres (735,358 square miles).", "latitude": -2.4833826, "longitude": 117.8902853}, {"country": "Iran", "fact": " It is bordered to the northwest by Armenia and Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and proximity to the Strait of Hormuz give it significant geostrategic importance.", "latitude": 32.6475314, "longitude": 54.5643516}, {"country": "Iraq", "fact": " It is bordered to the northwest by Armenia and Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and it. Its central location in Eurasia and proximity to the Strait of Hormuz give it significant geostrategic importance.", "latitude": 33.0955793, "longitude": 44.1749775}, {"country": "Ireland {Republic}", "fact": " The capital and largest city is Dublin, which is located on the eastern side of the island. Around 40% of the country's population of 4.9 million people resides in the greater Dublin area.", "latitude": 52.865196, "longitude": -7.9794599}, {"country": "Israel", "fact": " It has land borders with Lebanon to the north, Syria to the northeast, Jordan on the east, the Palestinian territories of the West Bank and Gaza Strip to the east and west, respectively, and Egypt to the southwest. The country contains geographically diverse features within its relatively small area.", "latitude": 31.5313113, "longitude": 34.8667654}, {"country": "Italy", "fact": " it is located in south-central Europe, and it is also considered a part of western Europe. A unitary parliamentary republic  with its capital in Rome, the country covers a total area of 301,340 km2 (116,350 sq mi) and shares land borders with France, Switzerland, Austria, Slovenia, and the enclaved microstates of Vatican City and San Marino.", "latitude": 42.6384261, "longitude": 12.674297}, {"country": "Ivory Coast", "fact": " it's political capital is Yamoussoukro in the centre of the country, while its economic capital and largest city is the port city of Abidjan. It borders Guinea to the northwest, Liberia to the west, Mali to the northwest, Burkina Faso to the northeast, Ghana to the east, and the Gulf of Guinea (Atlantic Ocean) to the south.", "latitude": 7.9897371, "longitude": -5.5679458}, {"country": "Jamaica", "fact": " Spanning 10,990 square kilometres (4,240 sq mi) in area, it is the third-largest island of the Greater Antilles and the Caribbean (after Cuba and Hispaniola). it lies about 145 kilometres (90 mi) south of Cuba, and 191 kilometres (119 mi) west of Hispaniola (the island containing the countries of Haiti and the Dominican Republic); the British Overseas Territory of the Cayman Islands lies some 215 kilometres (134 mi) to the north-west.", "latitude": 18.1152958, "longitude": -77.1598454610168}, {"country": "Japan", "fact": " It borders the Sea of it to the west and extends from the Sea of Okhotsk in the north to the East China Sea and Taiwan in the south. it is part of the Pacific Ring of Fire and comprises an archipelago of 6,852 islands covering 377,975 square kilometers (145,937 sq mi); its five main islands, from north to south, are Hokkaido, Honshu, Shikoku, Kyushu, and Okinawa.", "latitude": 36.5748441, "longitude": 139.2394179}, {"country": "Jordan", "fact": " Al-ʾUrdunn [al.ʔur.dunː]), officially the Hashemite Kingdom of it (Arabic: المملكة الأردنية الهاشمية‎; tr. Al-Mamlakah al-’Urdunniyyah Al-Hāshimiyyah), is an Arab country in Western Asia, on the East Bank of the it River.", "latitude": 31.1667049, "longitude": 36.941628}, {"country": "Kazakhstan", "fact": " It is the world's largest landlocked country, and the ninth-largest country in the world, with an area of 2,724,900 square kilometres (1,052,100 sq mi). it is the most dominant nation of Central Asia economically, generating 60% of the region's GDP, primarily through its oil and gas industry.", "latitude": 47.2286086, "longitude": 65.2093197}, {"country": "Kiribati", "fact": " The permanent population is just over 110,000 (2015), more than half of whom live on Tarawa atoll. The state comprises 32 atolls  and one raised coral island, Banaba.", "latitude": 0.306, "longitude": 173.664834025}, {"country": "Korea North", "fact": " The country is bordered to the north by China and by Russia along the Amnok (known as the Yalu in Chinese) and Tumen rivers, and to the south by South Korea, with the heavily fortified Korean Demilitarized Zone (DMZ) separating the two. North Korea, like its southern counterpart, claims to be the legitimate government of the entire peninsula and adjacent islands.", "latitude": 61.18541105, "longitude": 6.81350883350348}, {"country": "Korea South", "fact": "\nThe name Korea is derived from Goguryeo, which was one of the great powers in East Asia during its time, ruling most of the Korean Peninsula, Manchuria, parts of the Russian Far East and Inner Mongolia under Gwanggaeto the Great. Its capital, Seoul, is a major global city and half of South Korea's over 51 million people live in the Seoul Capital Area, the fourth largest metropolitan economy in the world.The Korean Peninsula was inhabited as early as the Lower Paleolithic period.", "latitude": 36.638392, "longitude": 127.6961188}, {"country": "Kosovo", "fact": " It possesses varied and diverse landscapes for its size by climate along with geology and hydrology. Most of central it is dominated by the vast plains and fields of Metohija and it.", "latitude": 42.5869578, "longitude": 20.9021231}, {"country": "Kuwait", "fact": " Situated in the northern edge of Eastern Arabia at the tip of the Persian Gulf, it borders Iraq to the north and Saudi Arabia to the south. As of 2016, it has a population of 4.5 million people: 1.3 million are itis and 3.2 million are expatriates.", "latitude": 29.2733964, "longitude": 47.4979476}, {"country": "Kyrgyzstan", "fact": " Kyrgyzskaya Respublika) and also known as Kirghizia (Russian: Киргизия, [kʲɪrˈɡʲizʲɪjə]), is a country in Central Asia. it is a landlocked country with mountainous terrain.", "latitude": 41.5089324, "longitude": 74.724091}, {"country": "Laos", "fact": " At the heart of the Indochinese peninsula, it is bordered by Myanmar and China to the northwest, Vietnam to the east, Cambodia to the southeast and Thailand to the west and southwest.Present it traces its historic and cultural identity to Lan Xang, which existed from the 14th century to the 18th century as one of the largest kingdoms in Southeast Asia. Due to its central geographical location in Southeast Asia, the kingdom became a hub for overland trade, and became wealthy economically and culturally.", "latitude": 20.0171109, "longitude": 103.378253}, {"country": "Latvia", "fact": " Since it’s independence in 1918, it has been referred to as one of the Baltic states. It is bordered by Estonia to the north, Lithuania to the south, Russia to the east, Belarus to the southeast, and shares a maritime border with Sweden to the west.", "latitude": 56.8406494, "longitude": 24.7537645}, {"country": "Lebanon", "fact": " It is bordered by Syria to the north and east and Israel to the south, while Cyprus is west across the Mediterranean Sea. it's location at the crossroads of the Mediterranean Basin and the Arabian hinterland had contributed to its rich history and shaped a cultural identity of religious and ethnic diversity.", "latitude": 33.8750629, "longitude": 35.843409}, {"country": "Lesotho", "fact": " Along with the Vatican City and San Marino, it is one of only three independent states completely surrounded by the territory of another country, and the only one outside the Italian peninsula or that is not a microstate. it is just over 30,000 km2 (11,583 sq mi) and has a population of around 2 million.", "latitude": -29.6039267, "longitude": 28.3350193}, {"country": "Liberia", "fact": " It is bordered by Sierra Leone to its northwest, Guinea to its north, Ivory Coast to its east, and the Atlantic Ocean to its south-southwest. It has a population of around 5 million and covers an area of 111,369 square kilometres (43,000 sq mi).", "latitude": 5.7499721, "longitude": -9.3658524}, {"country": "Libya", "fact": " The sovereign state is made of three historical regions: Tripolitania, Fezzan and Cyrenaica. With an area of almost 1.8 million square kilometres (700,000 sq mi), it is the fourth largest country in Africa, and is the 16th largest country in the world.", "latitude": 26.8234472, "longitude": 18.1236723}, {"country": "Liechtenstein", "fact": " The principality is a semi-constitutional monarchy headed by the Prince of it; the Prince's extensive powers are equivalent to those of a President in a semi-presidential system.\nit is bordered by Switzerland to the west and south and Austria to the east and north.", "latitude": 47.1416307, "longitude": 9.5531527}, {"country": "Lithuania", "fact": " it is one of the Baltic states. The country is situated along the southeastern shore of the Baltic Sea, to the east of Sweden and Denmark.", "latitude": 55.3500003, "longitude": 23.7499997}, {"country": "Luxembourg", "fact": " It is bordered by Belgium to the west and north, Germany to the east, and France to the south. Its capital, it City, is one of the four official capitals of the European Union (together with Brussels, Frankfurt, and Strasbourg) and the seat of the Court of Justice of the European Union, the highest judicial authority in the EU. Its culture, people, and languages are highly intertwined with its neighbours, making it essentially a mixture of French and German cultures, as evident by the nation's three official languages: French, German, and the national language of itish.", "latitude": 49.8158683, "longitude": 6.1296751}, {"country": "Madagascar", "fact": " At 592,800 square kilometres (228,900 sq mi) it is the world's second-largest island country. The nation comprises the island of it (the fourth-largest island in the world) and numerous smaller peripheral islands.", "latitude": -18.9249604, "longitude": 46.4416422}, {"country": "Malawi", "fact": " Mali is the eighth-largest country in Africa, with an area of just over 1,240,000 square kilometres (480,000 sq mi). The population of Mali is 19.1 million.", "latitude": -13.2687204, "longitude": 33.9301963}, {"country": "Malaysia", "fact": " The federal constitutional monarchy consists of thirteen states and three federal territories, separated by the South China Sea into two regions, Peninsular it and Borneo's East it. Peninsular it shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia.", "latitude": 4.5693754, "longitude": 102.2656823}, {"country": "Maldives", "fact": " It lies southwest of Sri Lanka and India, about 1,000 kilometres (620 mi) from the Asian continent. The chain of 26 atolls stretches from Ihavandhippolhu Atoll in the north to Addu Atoll in the south to the equator.", "latitude": 4.7064352, "longitude": 73.3287853}, {"country": "Mali", "fact": " It lies 80 km (50 mi) south of Italy, 284 km (176 mi) east of Tunisia, and 333 km (207 mi) north of Libya. With a population of about 515,000 over an area of 316 km2 (122 sq mi), Malta is the world's tenth smallest country in area and fourth most densely populated sovereign country.", "latitude": 16.3700359, "longitude": -2.2900239}, {"country": "Malta", "fact": " It lies 80 km (50 mi) south of Italy, 284 km (176 mi) east of Tunisia, and 333 km (207 mi) north of Libya. With a population of about 515,000 over an area of 316 km2 (122 sq mi), it is the world's tenth smallest country in area and fourth most densely populated sovereign country.", "latitude": 35.8885993, "longitude": 14.4476911}, {"country": "Marshall Islands", "fact": " Geographically, the country is part of the larger island group of Micronesia. The country's population of 58,413 people (at the 2018 World Bank Census) is spread out over 29 coral atolls, comprising 1,156 individual islands and islets.", "latitude": 9.0, "longitude": 168.0}, {"country": "Mauritania", "fact": " It is the eleventh largest sovereign state in Africa and is bordered by the Atlantic Ocean to the west, Western Sahara to the north and northwest, Algeria to the northeast, Mali to the east and southeast, and Senegal to the southwest.\nThe country derives its name from the ancient Berber kingdom of Mauretania, which existed from the 3rd century BCE into the 7th century CE in the modern-day Morocco and West Algeria.", "latitude": 20.2540382, "longitude": -9.2399263}, {"country": "Mauritius", "fact": " The country includes the islands of it, Rodrigues, Agaléga and St. Brandon.", "latitude": -20.2759451, "longitude": 57.5703566}, {"country": "Mexico", "fact": " It is bordered to the north by the United States; to the south and west by the Pacific Ocean; to the southeast by Guatemala, Belize, and the Caribbean Sea; and to the east by the Gulf of it. it covers 1,972,550 square kilometers (761,610 sq mi) and has approximately 128,649,565 inhabitants, making it the world's 13th-largest country by area, 10th-most populous country, and most populous Spanish-speaking nation.", "latitude": 19.4326296, "longitude": -99.1331785}, {"country": "Micronesia", "fact": " It has a close shared cultural history with two other island regions: Polynesia to the east and Melanesia to the south; as well as with the wider Austronesian peoples.\nThe region has a tropical marine climate and is part of the Oceanian realm.", "latitude": 8.6065, "longitude": 152.00846930625}, {"country": "Moldova", "fact": " It is bordered by Romania to the west and Ukraine to the north, east, and south. The capital city is Chișinău.", "latitude": 47.2879608, "longitude": 28.5670941}, {"country": "Monaco", "fact": " It is bordered by France to the north, east and west, and by the Mediterranean Sea to the south. The principality is home to 38,682 residents and is widely recognised for being one of the most expensive and wealthiest places in the world.", "latitude": 43.7323492, "longitude": 7.4276832}, {"country": "Mongolia", "fact": " Its area is roughly equivalent with the historical territory of Outer it, and that term is sometimes used to refer to the current state. It is sandwiched between Russia to the north and China to the south, where it neighbours the Inner it Autonomous Region.", "latitude": 46.8250388, "longitude": 103.8499736}, {"country": "Montenegro", "fact": " It borders Bosnia-Herzegovina to the northwest, Serbia to the northeast, Kosovo to the east, Albania to the southeast, the Adriatic Sea to the southwest, and Croatia to the west. it has an area of 13,812 square kilometres and a population of 620,079 (2011 census).", "latitude": 42.9868853, "longitude": 19.5180992}, {"country": "Morocco", "fact": " 'place the sun sets; the west'; Standard Moroccan Tamazight: ⵍⵎⵖⵔⵉⴱ, romanized: lmeɣrib; French: Maroc), officially the Kingdom of it (Arabic: المملكة المغربية‎, romanized: al-Mamlaka al-Maġribiyya, lit. 'The Western Kingdom'; Standard Moroccan Tamazight: ⵜⴰⴳⵍⴷⵉⵜ ⵏ ⵍⵎⵖⵔⵉⴱ, romanized: tageldit n lmaɣrib; French: Royaume du Maroc), is a country located in the Maghreb region of North Africa.", "latitude": 31.1728205, "longitude": -7.3362482}, {"country": "Mozambique", "fact": " The sovereign state is separated from the Comoros, Mayotte and Madagascar by the it Channel to the east. The capital and largest city of it is Maputo (formerly known as \"Lourenço Marques\" from 1876 to 1976).", "latitude": -19.302233, "longitude": 34.9144977}, {"country": "Myanmar, {Burma}", "fact": " Myanmar is bordered by Bangladesh and India to its northwest, China to its northeast, Laos and Thailand to its east and southeast, and the Andaman Sea and the Bay of Bengal to its south and southwest. With a size of 676,578 square kilometres (261,228 square miles), Myanmar is the largest of the Mainland Southeast Asian states by area.", "latitude": 17.1750495, "longitude": 95.9999652}, {"country": "Namibia", "fact": " Its western border is the Atlantic Ocean; it shares land borders with Zambia and Angola to the north, Botswana to the east and South Africa to the south and east. Although it does not border Zimbabwe, less than 200 metres (660 feet) of the Zambezi River separates the two countries.", "latitude": -23.2335499, "longitude": 17.3231107}, {"country": "Nauru", "fact": " Its nearest neighbour is Banaba Island in Kiribati, 300 km (190 mi) to the east. It further lies northwest of Tuvalu, 1,300 km (810 mi) northeast of the Solomon Islands, east-northeast of Papua New Guinea, southeast of the Federated States of Micronesia and south of the Marshall Islands.", "latitude": -0.5252306, "longitude": 166.9324426}, {"country": "Nepal", "fact": " It is mainly in the Himalayas, but also includes parts of the Indo-Gangetic Plain. It is the 49th largest country by population and 93rd largest country by area.", "latitude": 28.1083929, "longitude": 84.0917139}, {"country": "Netherlands", "fact": " In Europe, it consists of 12 provinces that border Germany to the east, Belgium to the south, and the North Sea to the northwest, with maritime borders in the North Sea with those countries and the United Kingdom. In the Caribbean, it consists of three special municipalities: the islands of Bonaire, Sint Eustatius and Saba.", "latitude": 52.5001698, "longitude": 5.7480821}, {"country": "New Zealand", "fact": " It comprises two main landmasses—the North Island (Te Ika-a-Māui) and the South Island (Te Waipounamu)—and around 600 smaller islands, covering a total area of 268,021 square kilometres (103,500 sq mi). it is about 2,000 kilometres (1,200 mi) east of Australia across the Tasman Sea and 1,000 kilometres (600 mi) south of the islands of New Caledonia, Fiji, and Tonga.", "latitude": -41.5000831, "longitude": 172.8344077}, {"country": "Nicaragua", "fact": " Managua is the country's capital and largest city and is also the third-largest city in Central America, behind Tegucigalpa and Guatemala City. The multi-ethnic population of six million includes people of indigenous, European, African, and Asian heritage.", "latitude": 12.6090157, "longitude": -85.2936911}, {"country": "Niger", "fact": " Its southern coast is on the Gulf of Guinea in the Atlantic Ocean. itia is a federal republic comprising 36 states and the Federal Capital Territory, where the capital, Abuja, is located.", "latitude": 17.7356214, "longitude": 9.3238432}, {"country": "Nigeria", "fact": " Its southern coast is on the Gulf of Guinea in the Atlantic Ocean. it is a federal republic comprising 36 states and the Federal Capital Territory, where the capital, Abuja, is located.", "latitude": 9.6000359, "longitude": 7.9999721}, {"country": "Norway", "fact": " The subantarctic Bouvet Island is a dependent territory of the Kingdom of it. it also lays claim to the Antarctic territories of Queen Maud Land and Peter I Island.", "latitude": 64.5731537, "longitude": 11.52803643954819}, {"country": "Oman", "fact": " It is bordered to the northwest by Armenia and Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of it, and to the west by Turkey and Iraq. Its central location in Eurasia and proximity to the Strait of Hormuz give it significant geostrategic importance.", "latitude": 21.0000287, "longitude": 57.0036901}, {"country": "Pakistan", "fact": " It is the world's fifth-most populous country with a population exceeding 212.2 million. It is the 33rd-largest country by area, spanning 881,913 square kilometres (340,509 square miles).", "latitude": 30.3308401, "longitude": 71.247499}, {"country": "Palau", "fact": " The country contains approximately 340 islands, and together with parts of the Federated States of Micronesia, forms the western chain of the Caroline Islands. Its area is 466 square kilometers (180 sq mi).", "latitude": 6.097367, "longitude": 133.313631}, {"country": "Panama", "fact": " The capital and largest city is it City, whose metropolitan area is home to nearly half the country's 4 million people.it was inhabited by indigenous tribes before Spanish colonists arrived in the 16th century. It broke away from Spain in 1821 and joined the Republic of Gran Colombia, a union of Nueva Granada, Ecuador, and Venezuela.", "latitude": 8.559559, "longitude": -81.1308434}, {"country": "Papua New Guinea", "fact": " Its capital, located along its southeastern coast, is Port Moresby. The western half of New Guinea forms the Indonesian provinces of Papua and West Papua.", "latitude": -5.6816069, "longitude": 144.2489081}, {"country": "Paraguay", "fact": " It is bordered by Argentina to the south and southwest, Brazil to the east and northeast, and Bolivia to the northwest. Although it is one of only two landlocked countries in South America (the other is Bolivia), the country has coasts, beaches and ports on the it and Paraná rivers that give exit to the Atlantic Ocean through the Paraná-it Waterway.", "latitude": -23.3165935, "longitude": -58.1693445}, {"country": "Peru", "fact": " It is bordered in the north by Ecuador and Colombia, in the east by Brazil, in the southeast by Bolivia, in the south by Chile, and in the west by the Pacific Ocean. it is a megadiverse country with habitats ranging from the arid plains of the Pacific coastal region in the west to the peaks of the Andes mountains vertically extending from the north to the southeast of the country to the tropical Amazon Basin rainforest in the east with the Amazon river.", "latitude": -6.8699697, "longitude": -75.0458515}, {"country": "Philippines", "fact": " Situated in the western Pacific Ocean, it consists of about 7,641 islands that are broadly categorized under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the it is Manila and the most populous city is Quezon City, both within the single urban area of Metro Manila.", "latitude": 12.7503486, "longitude": 122.7312101}, {"country": "Poland", "fact": " It is divided into 16 administrative subdivisions, covering an area of 312,696 square kilometres (120,733 sq mi), and has a largely temperate seasonal climate. With a population of nearly 38.5 million people, it is the fifth most populous member state of the European Union.", "latitude": 52.215933, "longitude": 19.134422}, {"country": "Portugal", "fact": " It is the westernmost sovereign state of mainland Europe, being bordered to the west and south by the Atlantic Ocean and to the north and east by Spain. Its territory also includes the Atlantic archipelagos of the Azores and Madeira, both autonomous regions with their own regional governments.", "latitude": 40.0332629, "longitude": -7.8896263}, {"country": "Romania", "fact": " It shares land borders with Bulgaria to the south, Ukraine to the north, Hungary to the west, Serbia to the southwest, and Moldova to the east and has its opening to the Black Sea. It has a predominantly temperate-continental climate.", "latitude": 45.9852129, "longitude": 24.6859225}, {"country": "Russian Federation", "fact": " Rossiya, IPA: [rɐˈsʲijə]), or the it, is a transcontinental country located in Eastern Europe and Northern Asia. Covering an area of 17,125,200 square kilometres (6,612,100 sq mi), it is the largest country in the world by area, spanning more than one-eighth of the Earth's inhabited land area, stretching eleven time zones, and bordering 16 sovereign nations.", "latitude": 64.6863136, "longitude": 97.7453061}, {"country": "Rwanda", "fact": " It is bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by it, and to the south by Tanzania. The southern part of the country includes a substantial portion of Lake Victoria, shared with Kenya and Tanzania.", "latitude": -1.9646631, "longitude": 30.0644358}, {"country": "St Kitts & Nevis", "fact": " Located in the Leeward Islands chain of the Lesser Antilles, it is the smallest sovereign state in the Western Hemisphere, in both area and population. The country is a Commonwealth realm, with Elizabeth II as Queen and head of state.The capital city is Basseterre on the larger island of Saint Kitts and on the smaller island, Nevis, the capital city is Charlestown.", "latitude": 17.250512, "longitude": -62.6725973}, {"country": "St Lucia", "fact": " The island was previously called Iyonola, the name given to the island by the native Amerindians and later, Hewanorra, the name given by the native Caribs. Part of the Lesser Antilles, it is located north/northeast of the island of Saint Vincent, northwest of Barbados and south of Martinique.", "latitude": 13.8250489, "longitude": -60.975036}, {"country": "Saint Vincent & the Grenadines", "fact": "\nIts 389 km2 (150 sq mi) territory consists of the main island of Saint Vincent and the northern two-thirds of the Grenadines, a chain of 32 smaller islands. Some of the Grenadines are inhabited — Bequia, Mustique, Union Island, Canouan, Palm Island, Mayreau, Young Island — while others are not: Tobago Cays, Petit Saint Vincent, Baliceaux, Bettowia, Quatre, Petite Mustique, Savan and Petit Nevis.", "latitude": 12.90447, "longitude": -61.2765569}, {"country": "Samoa", "fact": " The capital city is Apia. The Lapita people discovered and settled the itn Islands around 3,500 years ago.", "latitude": -13.7693895, "longitude": -172.1200508}, {"country": "San Marino", "fact": " Its capital is the City of it and its largest settlement is Dogana. it's official language is Italian.", "latitude": 43.9458623, "longitude": 12.458306}, {"country": "Sao Tome & Principe", "fact": " It consists of two archipelagos around the two main islands of São Tomé and Príncipe, about 140 km (87 mi) apart and about 250 and 225 km (155 and 140 mi) off the northwestern coast of Gabon.\nThe islands were uninhabited until their discovery by Portuguese explorers in the 15th century.", "latitude": 0.8875498, "longitude": 6.9648718}, {"country": "Saudi Arabia", "fact": " With a land area of approximately 2,150,000 km2 (830,000 sq mi), it is geographically the largest sovereign state in Western Asia, the second-largest in the Arab world (after Algeria), the fifth-largest in Asia, and the 12th-largest in the world. it is bordered by Jordan and Iraq to the north, Kuwait to the northeast, Qatar, Bahrain, and the United Arab Emirates to the east, Oman to the southeast and Yemen to the south; it is separated from Egypt and Israel by the Gulf of Aqaba.", "latitude": 25.6242618, "longitude": 42.3528328}, {"country": "Senegal", "fact": " it is bordered by Mauritania in the north, Mali to the east, Guinea to the southeast, and Guinea-Bissau to the southwest. it also surrounds The Gambia, a country occupying a narrow sliver of land along the banks of the Gambia River, which separates it's southern region of Casamance from the rest of the country.", "latitude": 14.4750607, "longitude": -14.4529612}, {"country": "Serbia", "fact": " It borders Hungary to the north, Romania to the northeast, Bulgaria to the southeast, North Macedonia to the south, Croatia and Bosnia and Herzegovina to the west, and Montenegro to the southwest. The country claims a border with Albania through the disputed territory of Kosovo.", "latitude": 44.024322850000004, "longitude": 21.07657433209902}, {"country": "Seychelles", "fact": " It consists of 115 islands.  Its capital and largest city, Victoria, lies 1,500 kilometres (932 mi) east of mainland Africa.", "latitude": -4.6574977, "longitude": 55.4540146}, {"country": "Sierra Leone", "fact": " It is bordered by Liberia to the southeast and Guinea to the northeast. it has a tropical climate with a diverse environment ranging from savanna to rainforests, a total area of 71,740 km2 (27,699 sq mi) and a population of 7,092,113 as of the 2015 census.", "latitude": 8.6400349, "longitude": -11.8400269}, {"country": "Singapore", "fact": " It lies about one degree of latitude (137 kilometres or 85 miles) north of the equator, off the southern tip of the Malay Peninsula, bordering the Straits of Malacca to the west, the Riau Islands to the south, and the South China Sea to the east. The country's territory is composed of one main island, 63 satellite islands and islets, and one outlying islet, the combined area of which has increased by 25% since the country's independence as a result of extensive land reclamation projects.", "latitude": 1.357107, "longitude": 103.8194992}, {"country": "Slovakia", "fact": " It is bordered by Poland to the north, Ukraine to the east, Hungary to the south, Austria to the southwest, and Czech Republic to the northwest. it's territory spans about 49,000 square kilometres (19,000 sq mi) and is mostly mountainous.", "latitude": 48.7411522, "longitude": 19.4528646}, {"country": "Slovenia", "fact": " it covers 20,271 square kilometers (7,827 sq mi) and has a population of 2.095 million. One of the successor states of the former Yugoslavia, it is now a parliamentary republic and member nation of the European Union, United Nations, and NATO. The capital and largest city is Ljubljana.it has a mostly mountainous terrain with a mainly continental climate, with the exception of the Slovene Littoral, which has a sub-Mediterranean climate, and of the Julian Alps in the northwest, which have an Alpine climate.", "latitude": 45.8133113, "longitude": 14.4808369}, {"country": "Solomon Islands", "fact": " The country takes its name from the it archipelago, which is a collection of Melanesian islands that also includes the North it (a part of Papua New Guinea), but excludes outlying islands, such as Rennell and Bellona, and the Santa Cruz Islands.\nIn 1568, the Spanish navigator Álvaro de Mendaña was the first European to visit them, naming them the Islas Salomón.", "latitude": -9.7354344, "longitude": 162.8288542}, {"country": "Somalia", "fact": " It is bordered by Ethiopia to the west, the Gulf of Aden to the north, the Guardafui Channel and Somali Sea to the east, and Kenya to the southwest. it has the longest coastline on Africa's mainland.", "latitude": 8.3676771, "longitude": 49.083416}, {"country": "South Africa", "fact": " It may also be considered a subcontinent of the Americas, which is how it is viewed in Spanish and Portuguese-speaking regions of the Americas. The reference to South America instead of other regions (like Latin America or the Southern Cone) has increased in the last decades due to changing geopolitical dynamics (in particular, the rise of Brazil).It is bordered on the west by the Pacific Ocean and on the north and east by the Atlantic Ocean; North America and the Caribbean Sea lie to the northwest.", "latitude": -28.8166236, "longitude": 24.991639}, {"country": "South Sudan", "fact": " It is bordered to the east by Ethiopia, to the north by Sudan, to the west by the Central African Republic, to the south-west by Democratic Republic of the Congo, to the south by Uganda and to the south east by Kenya. \nIt gained independence from the Republic of the Sudan in 2011, making it the most recent sovereign state or country with widespread recognition.", "latitude": 7.8699431, "longitude": 29.6667897}, {"country": "Spain", "fact": " Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagos: the Canary Islands off the coast of North Africa, and the Balearic Islands in the Mediterranean Sea.", "latitude": 39.3262345, "longitude": -4.8380649}, {"country": "Sri Lanka", "fact": " It is geographically separated from the Indian subcontinent by the Gulf of Mannar and the Palk Strait. Sri Jayawardenepura Kotte is its legislative capital, and Colombo is its largest city and centre of commerce.", "latitude": 7.5554942, "longitude": 80.7137847}, {"country": "Sudan", "fact": " Bordered by Egypt to the north, Libya to the northwest, Chad to the west, the Central African Republic to the southwest, South it to the south, Ethiopia to the southeast, Eritrea to the east, and the Red Sea to the northeast. it has a population of 43 million (2018 estimate) and occupies 1,886,068 square kilometres (728,215 square miles), making it Africa's third-largest country and also the third-largest in the Arab world.", "latitude": 14.5844444, "longitude": 29.4917691}, {"country": "Suriname", "fact": " Depending on the culture, all members of a family unit may have identical surnames or there may be variations based on the cultural rules.\n\n\n== Cultural differences ==\nIn the English-speaking world, a surname is commonly referred to as a last name because it is usually placed at the end of a person's full name, after any given names.", "latitude": 4.1413025, "longitude": -56.0771187}, {"country": "Swaziland", "fact": " It is bordered by Mozambique to its northeast and South Africa to its north, west, and south. At no more than 200 kilometres (120 mi) north to south and 130 kilometres (81 mi) east to west, Eswatini is one of the smallest countries in Africa; despite this, its climate and topography are diverse, ranging from a cool and mountainous highveld to a hot and dry lowveld.", "latitude": -26.5624806, "longitude": 31.3991317}, {"country": "Sweden", "fact": " It borders Norway to the west and north, Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Öresund Strait. At 450,295 square kilometres (173,860 sq mi), it is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area.", "latitude": 59.6749712, "longitude": 14.5208584}, {"country": "Switzerland", "fact": " It is a federal republic composed of 26 cantons, with federal authorities based in Bern. it is a landlocked country bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east.", "latitude": 46.7985624, "longitude": 8.2319736}, {"country": "Syria", "fact": " A country of fertile plains, high mountains, and deserts, it is home to diverse ethnic and religious groups, including itn Arabs, Kurds, Turkemens, Assyrians, Armenians, Circassians, Mandeans and Greeks. Religious groups include Sunnis, Christians, Alawites, Druze, Isma'ilis, Mandeans, Shiites, Salafis, Yazidis, and Jews.", "latitude": 34.6401861, "longitude": 39.0494106}, {"country": "Taiwan", "fact": " Neighbouring countries include the People's Republic of China (PRC) to the northwest, Japan to the northeast, and the Philippines to the south. The main island of it has an area of 35,808 square kilometres (13,826 sq mi), with mountain ranges dominating the eastern two-thirds and plains in the western third, where its highly urbanised population is concentrated.", "latitude": 23.59829785, "longitude": 120.83536313817521}, {"country": "Tajikistan", "fact": " It is bordered by Afghanistan to the south, Uzbekistan to the west, Kyrgyzstan to the north and China to the east. The traditional homelands of the Tajik people include present-day it as well as parts of Afghanistan and Uzbekistan.", "latitude": 38.6281733, "longitude": 70.8156541}, {"country": "Tanzania", "fact": " It borders Uganda to the north; Kenya to the northeast; Comoro Islands and the Indian Ocean to the east; Mozambique and Malawi to the south; Zambia to the southwest; and Rwanda, Burundi, and the Democratic Republic of the Congo to the west. Mount Kilimanjaro, Africa's highest mountain, is in northeastern it.", "latitude": -6.5247123, "longitude": 35.7878438}, {"country": "Thailand", "fact": " Located at the centre of the Indochinese Peninsula, it is composed of 76 provinces, and covers an area of 513,120 square kilometres (198,120 sq mi), and a population of over 66 million people. it is the world's 50th-largest country by land area, and the 22nd-most-populous country in the world.", "latitude": 14.8971921, "longitude": 100.83273}, {"country": "Togo", "fact": " 2go  supports over 1,500 different devices, including feature phones, in addition to Android, BlackBerry OS and BlackBerry 10 smartphones. 2go has over 50 million registered users across Africa with 13 million active users based within Nigeria.", "latitude": 8.7800265, "longitude": 1.0199765}, {"country": "Tonga", "fact": " The total surface area is about 750 square kilometres (290 sq mi) scattered over 700,000 square kilometres (270,000 sq mi) of the southern Pacific Ocean. As of 2016, the state had a population of 100,651 people, of whom 70% reside on the main island of ittapu.", "latitude": -19.9160819, "longitude": -175.2026424}, {"country": "Trinidad & Tobago", "fact": " Consisting of the main islands Trinidad and Tobago, and numerous much smaller islands, it is situated 130 kilometres (81 miles) south of Grenada and 11 kilometres (6.8 miles) off the coast of northeastern Venezuela. It shares maritime boundaries with Barbados to the northeast, Grenada to the northwest, Guyana to the southeast, and Venezuela to the south and west.The island of Trinidad was inhabited for centuries by native Amerindian peoples before becoming a colony in the Spanish Empire, following the arrival of Christopher Columbus in 1498.", "latitude": 10.8677845, "longitude": -60.9821067}, {"country": "Tunisia", "fact": " Its northernmost point, Cape Angela, is also the northernmost point on the African continent. it is bordered by Algeria to the west and southwest, Libya to the southeast, and the Mediterranean Sea to the north and east.", "latitude": 33.8439408, "longitude": 9.400138}, {"country": "Turkey", "fact": " East Thrace, the part of it in Europe, is separated from Anatolia by the Sea of Marmara, the Bosporus and the Dardanelles (collectively called the Turkish Straits). Istanbul, which straddles Europe and Asia, is the largest city in the country, while Ankara is the capital.", "latitude": 38.9597594, "longitude": 34.9249653}, {"country": "Turkmenistan", "fact": " Ashgabat is the capital and largest city of the country. The population of the country is 6 million, the lowest of the Central Asian republics.", "latitude": 39.3763807, "longitude": 59.3924609}, {"country": "Tuvalu", "fact": " The island country lies east-northeast of the Santa Cruz Islands (which belong to the Solomon Islands), southeast of Nauru, south of Kiribati, west of Tokelau, northwest of Samoa and Wallis and Futuna, and north of Fiji. It is composed of three reef islands and six true atolls spread out between the latitude of 5° to 10° south and longitude of 176° to 180°, west of the International Date Line.", "latitude": -7.768959, "longitude": 178.1167698}, {"country": "Uganda", "fact": " It is bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by Rwanda, and to the south by Tanzania. The southern part of the country includes a substantial portion of Lake Victoria, shared with Kenya and Tanzania.", "latitude": 1.5333554, "longitude": 32.2166578}, {"country": "Ukraine", "fact": " Ukraína, IPA: [ʊkrɐˈinə]) is a country in Eastern Europe. It is bordered by Russia to the north-east; Belarus to the north; Poland, Slovakia and Hungary to the west; and Romania, Moldova, and the Black Sea to the south.", "latitude": 49.4871968, "longitude": 31.2718321}, {"country": "United Arab Emirates", "fact": " The sovereign constitutional monarchy is a federation of seven emirates consisting of Abu Dhabi (which serves as the capital), Ajman, Dubai, Fujairah, Ras Al Khaimah, Sharjah and Umm Al Quwain. Their boundaries are complex, with numerous enclaves within the various emirates.", "latitude": 24.0002488, "longitude": 53.9994829}, {"country": "United Kingdom", "fact": " The it includes the island of Great Britain, the north­eastern part of the island of Ireland, and many smaller islands. Northern Ireland shares  a land border with the Republic of Ireland.", "latitude": 54.7023545, "longitude": -3.2765753}, {"country": "United States", "fact": " It consists of 50 states, a federal district, five major self-governing territories, and various possessions. At 3.8 million square miles (9.8 million km2), it is the world's third- or fourth-largest country by total area.", "latitude": 39.7837304, "longitude": -100.4458825}, {"country": "Uruguay", "fact": " It borders Argentina to its west and southwest and Brazil to its north and east, with the Río de la Plata (River of Silver) to the south and the Atlantic Ocean to the southeast. it is home to an estimated 3.51 million people, of whom 1.8 million live in the metropolitan area of its capital and largest city, Montevideo.", "latitude": -32.8755548, "longitude": -56.0201525}, {"country": "Uzbekistan", "fact": " It is surrounded by five landlocked countries: Kazakhstan to the north; Kyrgyzstan to the northeast; Tajikistan to the southeast; Afghanistan to the south and Turkmenistan to the south-west. Along with Liechtenstein, it is one of two doubly landlocked countries.", "latitude": 41.32373, "longitude": 63.9528098}, {"country": "Vanuatu", "fact": " The archipelago, which is of volcanic origin, is 1,750 kilometres (1,090 mi) east of northern Australia, 540 kilometres (340 mi) northeast of New Caledonia, east of New Guinea, southeast of the Solomon Islands, and west of Fiji.\nit was first inhabited by Melanesian people.", "latitude": -16.5255069, "longitude": 168.1069154}, {"country": "Vatican City", "fact": " it became independent from Italy with the Lateran Treaty (1929), and it is a distinct territory under \"full ownership, exclusive dominion, and sovereign authority and jurisdiction\" of the Holy See, itself a sovereign entity of international law, which maintains the city state's temporal, diplomatic, and spiritual independence. With an area of 49 hectares (121 acres) and a population of about 805, it is the smallest sovereign state in the world by both area and population.As governed by the Holy See, the it is an ecclesiastical or sacerdotal-monarchical state (a type of theocracy) ruled by the pope who is the bishop of Rome and head of the Catholic Church.", "latitude": 41.9034912, "longitude": 12.4528349}, {"country": "Venezuela", "fact": " It has a territorial extension of 916,445 km2 (353,841 sq mi) and the population of it was estimated at 28 million in 2019. The capital and largest urban agglomeration is the city of Caracas.", "latitude": 8.0018709, "longitude": -66.1109318}, {"country": "Vietnam", "fact": " With an estimated 96.2 million inhabitants as of 2019, it is the 15th most populous country in the world. it shares its land borders with China to the north, and Laos and Cambodia to the west.", "latitude": 13.2904027, "longitude": 108.4265113}, {"country": "Yemen", "fact": " It is the second-largest Arab sovereign state in the peninsula, occupying 527,970 square kilometres (203,850 square miles). The coastline stretches for about 2,000 kilometres (1,200 miles).", "latitude": 16.3471243, "longitude": 47.8915271}, {"country": "Zambia", "fact": " Its neighbours are the Democratic Republic of the Congo to the north, Tanzania to the north-east, Malawi to the east, Mozambique to the southeast, Zimbabwe and Botswana to the south, Namibia to the southwest, and Angola to the west. The capital city is Lusaka, located in the south-central part of it.", "latitude": -14.5186239, "longitude": 27.5599164}, {"country": "Zimbabwe", "fact": " The capital and largest city is Harare. The second largest city is Bulawayo.", "latitude": -18.4554963, "longitude": 29.7468414}]}